espressif/esp-idf/components/soc/esp32c5/include/soc/mcpwm_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration register */
/** Type of clk_cfg register
 *  PWM clock prescaler register.
 */
typedef union {
    struct {
        /** clk_prescale : R/W; bitpos: [7:0]; default: 0;
         *  Configures the prescaler value of clock, so that the period of PWM_clk = 6.25ns *
         *  (PWM_CLK_PRESCALE + 1).
         */
        uint32_t clk_prescale:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} mcpwm_clk_cfg_reg_t;

/** Type of timern_cfg0 register
 *  PWM timern period and update method configuration register.
 */
typedef union {
    struct {
        /** timern_prescale : R/W; bitpos: [7:0]; default: 0;
         *  Configures the prescaler value of timern, so that the period of PT0_clk = Period of
         *  PWM_clk * (PWM_TIMERn_PRESCALE + 1)
         */
        uint32_t timern_prescale:8;
        /** timern_period : R/W; bitpos: [23:8]; default: 255;
         *  Configures the period shadow of PWM timern
         */
        uint32_t timern_period:16;
        /** timern_period_upmethod : R/W; bitpos: [25:24]; default: 0;
         *  Configures the update method for active register of PWM timern period.\\0:
         *  Immediate\\1: TEZ\\2: Sync\\3: TEZ or sync\\TEZ here and below means timer equal
         *  zero event
         */
        uint32_t timern_period_upmethod:2;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} mcpwm_timern_cfg0_reg_t;

/** Type of timern_cfg1 register
 *  PWM timern working mode and start/stop control register.
 */
typedef union {
    struct {
        /** timern_start : R/W/SC; bitpos: [2:0]; default: 0;
         *  Configures whether or not to start/stop PWM timern.\\0: If PWM timern starts, then
         *  stops at TEZ\\1: If timern starts, then stops at TEP\\2: PWM timern starts and runs
         *  on\\3: Timern starts and stops at the next TEZ\\4: Timer0 starts and stops at the
         *  next TEP.\\TEP here and below means the event that happens when the timer equals to
         *  period
         */
        uint32_t timern_start:3;
        /** timern_mod : R/W; bitpos: [4:3]; default: 0;
         *  Configures the working mode of PWM timern.\\0: Freeze\\1: Increase mode\\2:
         *  Decrease mode\\3: Up-down mode
         */
        uint32_t timern_mod:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_timern_cfg1_reg_t;

/** Type of timern_sync register
 *  PWM timern sync function configuration register.
 */
typedef union {
    struct {
        /** timern_synci_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timern reloading with phase on sync input event
         *  is enabled.\\0: Disable\\1: Enable
         */
        uint32_t timern_synci_en:1;
        /** timern_sync_sw : R/W; bitpos: [1]; default: 0;
         *  Configures the generation of software sync. Toggling this bit will trigger a
         *  software sync.
         */
        uint32_t timern_sync_sw:1;
        /** timern_synco_sel : R/W; bitpos: [3:2]; default: 0;
         *  Configures the selection of PWM timern sync_out.\\0: Sync_in\\1: TEZ\\2: TEP\\3:
         *  Invalid, sync_out selects noting
         */
        uint32_t timern_synco_sel:2;
        /** timern_phase : R/W; bitpos: [19:4]; default: 0;
         *  Configures the phase for timern reload on sync event.
         */
        uint32_t timern_phase:16;
        /** timern_phase_direction : R/W; bitpos: [20]; default: 0;
         *  Configures the PWM timern's direction when timern mode is up-down mode.\\0:
         *  Increase\\1: Decrease
         */
        uint32_t timern_phase_direction:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} mcpwm_timern_sync_reg_t;

/** Type of timern_status register
 *  PWM timern status register.
 */
typedef union {
    struct {
        /** timern_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timern counter value.
         */
        uint32_t timern_value:16;
        /** timern_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timern counter direction.\\0: Increment\\1: Decrement
         */
        uint32_t timern_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timern_status_reg_t;

/** Type of timer_synci_cfg register
 *  Synchronization input selection register for PWM timers.
 */
typedef union {
    struct {
        /** timer0_syncisel : R/W; bitpos: [2:0]; default: 0;
         *  Configures the selection of sync input for PWM timer0.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer0_syncisel:3;
        /** timer1_syncisel : R/W; bitpos: [5:3]; default: 0;
         *  Configures the selection of sync input for PWM timer1.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer1_syncisel:3;
        /** timer2_syncisel : R/W; bitpos: [8:6]; default: 0;
         *  Configures the selection of sync input for PWM timer2.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer2_syncisel:3;
        /** external_synci0_invert : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to invert SYNC0 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci0_invert:1;
        /** external_synci1_invert : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to invert SYNC1 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci1_invert:1;
        /** external_synci2_invert : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to invert SYNC2 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci2_invert:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} mcpwm_timer_synci_cfg_reg_t;

/** Type of operator_timersel register
 *  PWM operator's timer select register
 */
typedef union {
    struct {
        /** operator0_timersel : R/W; bitpos: [1:0]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator0.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator0_timersel:2;
        /** operator1_timersel : R/W; bitpos: [3:2]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator1.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator1_timersel:2;
        /** operator2_timersel : R/W; bitpos: [5:4]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator2.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator2_timersel:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_operator_timersel_reg_t;


