espressif/esp-idf/components/soc/esp32c5/include/soc/mcpwm_struct.h
/** Group: cfgrep */
/** Type of genn_stmp_cfg register
 *  Generatorn time stamp registers A and B transfer status and update method register
 */
typedef union {
    struct {
        /** genn_a_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures the update method for PWM generator n time stamp A's active
         *  register.\\0: Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is
         *  set to 1: Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t genn_a_upmethod:4;
        /** genn_b_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures the update method for PWM generator n time stamp B's active
         *  register.\\0: Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is
         *  set to 1: Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t genn_b_upmethod:4;
        /** genn_a_shdw_full : R/W/WTC/SC; bitpos: [8]; default: 0;
         *  Represents whether or not generatorn time stamp A's shadow reg is transferred.\\0:
         *  A's active reg has been updated with shadow register latest value.\\1: A's shadow
         *  reg is filled and waiting to be transferred to A's active reg
         */
        uint32_t genn_a_shdw_full:1;
        /** genn_b_shdw_full : R/W/WTC/SC; bitpos: [9]; default: 0;
         *  Represents whether or not generatorn time stamp B's shadow reg is transferred.\\0:
         *  B's active reg has been updated with shadow register latest value.\\1: B's shadow
         *  reg is filled and waiting to be transferred to B's active reg
         */
        uint32_t genn_b_shdw_full:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_genn_stmp_cfg_reg_t;

/** Type of genn_tstmp_a register
 *  Generatorn time stamp A's shadow register
 */
typedef union {
    struct {
        /** genn_a : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator n time stamp A's shadow register.
         */
        uint32_t genn_a:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_tstmp_a_reg_t;

/** Type of genn_tstmp_b register
 *  Generatorn time stamp B's shadow register
 */
typedef union {
    struct {
        /** genn_b : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator n time stamp B's shadow register.
         */
        uint32_t genn_b:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_tstmp_b_reg_t;

/** Type of genn_cfg0 register
 *  Generatorn fault event T0 and T1 configuration register
 */
typedef union {
    struct {
        /** genn_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for PWM generator n's active register.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t genn_cfg_upmethod:4;
        /** genn_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Configures source selection for PWM generator n event_t0, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t genn_t0_sel:3;
        /** genn_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Configures source selection for PWM generator n event_t1, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t genn_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_genn_cfg0_reg_t;

/** Type of genn_force register
 *  Generatorn output signal force mode register.
 */
typedef union {
    struct {
        /** genn_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Configures update method for continuous software force of PWM generatorn.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  TEA\\Bit3 is set to 1: TEB\\Bit4 is set to 1: Sync\\Bit5 is set to 1: Disable
         *  update. TEA/B here and below means an event generated when the timer's value equals
         *  to that of register A/B.
         */
        uint32_t genn_cntuforce_upmethod:6;
        /** genn_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures continuous software force mode for PWMn A.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t genn_a_cntuforce_mode:2;
        /** genn_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Configures continuous software force mode for PWMn B.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t genn_b_cntuforce_mode:2;
        /** genn_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  A, a toggle will trigger a force event.
         */
        uint32_t genn_a_nciforce:1;
        /** genn_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn A.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t genn_a_nciforce_mode:2;
        /** genn_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  B, a toggle will trigger a force event.
         */
        uint32_t genn_b_nciforce:1;
        /** genn_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn B.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t genn_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_force_reg_t;

/** Type of genn_a register
 *  PWMn output signal A actions configuration register
 */
typedef union {
    struct {
        /** genn_a_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWMn A triggered by event TEZ when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_utez:2;
        /** genn_a_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWMn A triggered by event TEP when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_utep:2;
        /** genn_a_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWMn A triggered by event TEA when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_utea:2;
        /** genn_a_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWMn A triggered by event TEB when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_uteb:2;
        /** genn_a_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWMn A triggered by event_t0 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_ut0:2;
        /** genn_a_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWMn A triggered by event_t1 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_ut1:2;
        /** genn_a_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWMn A triggered by event TEZ when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dtez:2;
        /** genn_a_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWMn A triggered by event TEP when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dtep:2;
        /** genn_a_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWMn A triggered by event TEA when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dtea:2;
        /** genn_a_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWMn A triggered by event TEB when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dteb:2;
        /** genn_a_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWMn A triggered by event_t0 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dt0:2;
        /** genn_a_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWMn A triggered by event_t1 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_a_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_genn_a_reg_t;

/** Type of genn_b register
 *  PWMn output signal B actions configuration register
 */
typedef union {
    struct {
        /** genn_b_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWMn B triggered by event TEZ when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_utez:2;
        /** genn_b_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWMn B triggered by event TEP when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_utep:2;
        /** genn_b_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWMn B triggered by event TEA when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_utea:2;
        /** genn_b_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWMn B triggered by event TEB when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_uteb:2;
        /** genn_b_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWMn B triggered by event_t0 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_ut0:2;
        /** genn_b_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWMn B triggered by event_t1 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_ut1:2;
        /** genn_b_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWMn B triggered by event TEZ when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dtez:2;
        /** genn_b_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWMn B triggered by event TEP when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dtep:2;
        /** genn_b_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWMn B triggered by event TEA when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dtea:2;
        /** genn_b_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWMn B triggered by event TEB when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dteb:2;
        /** genn_b_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWMn B triggered by event_t0 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dt0:2;
        /** genn_b_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWMn B triggered by event_t1 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t genn_b_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_genn_b_reg_t;

/** Type of dtn_cfg register
 *  Dead time configuration register
 */
typedef union {
    struct {
        /** dtn_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for FED (Falling edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t dtn_fed_upmethod:4;
        /** dtn_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures update method for RED (rising edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t dtn_red_upmethod:4;
        /** dtn_deb_mode : R/W; bitpos: [8]; default: 0;
         *  Configures S8 in table, dual-edge B mode.\\0: fed/red take effect on different path
         *  separately\\1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t dtn_deb_mode:1;
        /** dtn_a_outswap : R/W; bitpos: [9]; default: 0;
         *  Configures S6 in table.
         */
        uint32_t dtn_a_outswap:1;
        /** dtn_b_outswap : R/W; bitpos: [10]; default: 0;
         *  Configures S7 in table.
         */
        uint32_t dtn_b_outswap:1;
        /** dtn_red_insel : R/W; bitpos: [11]; default: 0;
         *  Configures S4 in table.
         */
        uint32_t dtn_red_insel:1;
        /** dtn_fed_insel : R/W; bitpos: [12]; default: 0;
         *  Configures S5 in table.
         */
        uint32_t dtn_fed_insel:1;
        /** dtn_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  Configures S2 in table.
         */
        uint32_t dtn_red_outinvert:1;
        /** dtn_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  Configures S3 in table.
         */
        uint32_t dtn_fed_outinvert:1;
        /** dtn_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  Configures S1 in table.
         */
        uint32_t dtn_a_outbypass:1;
        /** dtn_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  Configures S0 in table.
         */
        uint32_t dtn_b_outbypass:1;
        /** dtn_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Configures dead time generator n clock selection.\\0: PWM_clk\\1: PT_clk
         */
        uint32_t dtn_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dtn_cfg_reg_t;

/** Type of dtn_fed_cfg register
 *  Falling edge delay (FED) shadow register
 */
typedef union {
    struct {
        /** dtn_fed : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for FED.
         */
        uint32_t dtn_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_fed_cfg_reg_t;

/** Type of dtn_red_cfg register
 *  Rising edge delay (RED) shadow register
 */
typedef union {
    struct {
        /** dtn_red : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for RED.
         */
        uint32_t dtn_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_red_cfg_reg_t;

/** Type of carriern_cfg register
 *  Carriern configuration register
 */
typedef union {
    struct {
        /** carriern_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable carriern.\\0: Bypassed\\1: Enabled
         */
        uint32_t carriern_en:1;
        /** carriern_prescale : R/W; bitpos: [4:1]; default: 0;
         *  Configures the prescale value of PWM carriern clock (PC_clk), so that period of
         *  PC_clk = period of PWM_clk * (PWM_CARRIERn_PRESCALE + 1)
         */
        uint32_t carriern_prescale:4;
        /** carriern_duty : R/W; bitpos: [7:5]; default: 0;
         *  Configures carrier duty. Duty = PWM_CARRIERn_DUTY / 8
         */
        uint32_t carriern_duty:3;
        /** carriern_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  Configures width of the first pulse. Measurement unit: Periods of the carrier.
         */
        uint32_t carriern_oshtwth:4;
        /** carriern_out_invert : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to invert the output of PWMn A and PWMn B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t carriern_out_invert:1;
        /** carriern_in_invert : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to invert the input of PWMn A and PWMn B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t carriern_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carriern_cfg_reg_t;

/** Type of fhn_cfg0 register
 *  PWMn A and PWMn B trip events actions configuration register
 */
typedef union {
    struct {
        /** fhn_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable software force cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_sw_cbc:1;
        /** fhn_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not event_f2 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f2_cbc:1;
        /** fhn_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not event_f1 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f1_cbc:1;
        /** fhn_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not event_f0 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f0_cbc:1;
        /** fhn_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable software force one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_sw_ost:1;
        /** fhn_f2_ost : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not event_f2 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f2_ost:1;
        /** fhn_f1_ost : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not event_f1 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f1_ost:1;
        /** fhn_f0_ost : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not event_f0 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t fhn_f0_ost:1;
        /** fhn_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_a_cbc_d:2;
        /** fhn_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_a_cbc_u:2;
        /** fhn_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_a_ost_d:2;
        /** fhn_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_a_ost_u:2;
        /** fhn_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_b_cbc_d:2;
        /** fhn_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_b_cbc_u:2;
        /** fhn_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_b_ost_d:2;
        /** fhn_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t fhn_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fhn_cfg0_reg_t;

/** Type of fhn_cfg1 register
 *  Software triggers for fault handler actions configuration register
 */
typedef union {
    struct {
        /** fhn_clr_ost : R/W; bitpos: [0]; default: 0;
         *  Configures the generation of software one-shot mode action clear. A toggle
         *  (software negate its value) triggers a clear for on going one-shot mode action.
         */
        uint32_t fhn_clr_ost:1;
        /** fhn_cbcpulse : R/W; bitpos: [2:1]; default: 0;
         *  Configures the refresh moment selection of cycle-by-cycle mode action.\\0: Select
         *  nothing, will not refresh\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP
         */
        uint32_t fhn_cbcpulse:2;
        /** fhn_force_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures the generation of software cycle-by-cycle mode action. A toggle
         *  (software negate its value) triggers a cycle-by-cycle mode action.
         */
        uint32_t fhn_force_cbc:1;
        /** fhn_force_ost : R/W; bitpos: [4]; default: 0;
         *  Configures the generation of software one-shot mode action. A toggle (software
         *  negate its value) triggers a one-shot mode action.
         */
        uint32_t fhn_force_ost:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_fhn_cfg1_reg_t;

