espressif/esp-idf/components/soc/esp32c5/include/soc/mcpwm_struct.h
/** Type of fhn_status register
 *  Fault events status register
 */
typedef union {
    struct {
        /** fhn_cbc_on : RO; bitpos: [0]; default: 0;
         *  Represents whether or not an cycle-by-cycle mode action is on going.\\0:No
         *  action\\1: On going
         */
        uint32_t fhn_cbc_on:1;
        /** fhn_ost_on : RO; bitpos: [1]; default: 0;
         *  Represents whether or not an one-shot mode action is on going.\\0:No action\\1: On
         *  going
         */
        uint32_t fhn_ost_on:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} mcpwm_fhn_status_reg_t;


/** Group: fault det */
/** Type of fault_detect register
 *  Fault detection configuration and status register
 */
typedef union {
    struct {
        /** f0_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable event_f0 generation.\\0: Disable\\1: Enable
         */
        uint32_t f0_en:1;
        /** f1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable event_f1 generation.\\0: Disable\\1: Enable
         */
        uint32_t f1_en:1;
        /** f2_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable event_f2 generation.\\0: Disable\\1: Enable
         */
        uint32_t f2_en:1;
        /** f0_pole : R/W; bitpos: [3]; default: 0;
         *  Configures event_f0 trigger polarity on FAULT0 source from GPIO matrix.\\0: Level
         *  low\\1: Level high
         */
        uint32_t f0_pole:1;
        /** f1_pole : R/W; bitpos: [4]; default: 0;
         *  Configures event_f1 trigger polarity on FAULT1 source from GPIO matrix.\\0: Level
         *  low\\1: Level high
         */
        uint32_t f1_pole:1;
        /** f2_pole : R/W; bitpos: [5]; default: 0;
         *  Configures event_f2 trigger polarity on FAULT2 source from GPIO matrix.\\0: Level
         *  low\\1: Level high
         */
        uint32_t f2_pole:1;
        /** event_f0 : RO; bitpos: [6]; default: 0;
         *  Represents whether or not an event_f0 is on going.\\0: No action\\1: On going
         */
        uint32_t event_f0:1;
        /** event_f1 : RO; bitpos: [7]; default: 0;
         *  Represents whether or not an event_f1 is on going.\\0: No action\\1: On going
         */
        uint32_t event_f1:1;
        /** event_f2 : RO; bitpos: [8]; default: 0;
         *  Represents whether or not an event_f2 is on going.\\0: No action\\1: On going
         */
        uint32_t event_f2:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} mcpwm_fault_detect_reg_t;


/** Group: sync */
/** Type of cap_timer_cfg register
 *  Capture timer configuration register
 */
typedef union {
    struct {
        /** cap_timer_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable capture timer increment.\\0: Disable\\1: Enable
         */
        uint32_t cap_timer_en:1;
        /** cap_synci_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable capture timer sync.\\0: Disable\\1: Enable
         */
        uint32_t cap_synci_en:1;
        /** cap_synci_sel : R/W; bitpos: [4:2]; default: 0;
         *  Configures the selection of capture module sync input.\\0: None\\1: Timer0
         *  sync_out\\2: Timer1 sync_out\\3: Timer2 sync_out\\4: SYNC0 from GPIO matrix\\5:
         *  SYNC1 from GPIO matrix\\6: SYNC2 from GPIO matrix\\7: None
         */
        uint32_t cap_synci_sel:3;
        /** cap_sync_sw : WT; bitpos: [5]; default: 0;
         *  Configures the generation of a capture timer sync when reg_cap_synci_en is 1.\\0:
         *  Invalid, No effect\\1: Trigger a capture timer sync, capture timer is loaded with
         *  value in phase register
         */
        uint32_t cap_sync_sw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_cap_timer_cfg_reg_t;


/** Group: phase */
/** Type of cap_timer_phase register
 *  Capture timer sync phase register
 */
typedef union {
    struct {
        /** cap_phase : R/W; bitpos: [31:0]; default: 0;
         *  Configures phase value for capture timer sync operation.
         */
        uint32_t cap_phase:32;
    };
    uint32_t val;
} mcpwm_cap_timer_phase_reg_t;


/** Group: cap_cfg */
/** Type of cap_chn_cfg register
 *  Capture channel n configuration register
 */
typedef union {
    struct {
        /** capn_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable capture on channel n.\\0: Disable\\1: Enable
         */
        uint32_t capn_en:1;
        /** capn_mode : R/W; bitpos: [2:1]; default: 0;
         *  Configures which edge of capture on channel n after prescaling is used.\\0:
         *  None\\Bit0 is set to 1: Rnable capture on the negative edge\\Bit1 is set to 1:
         *  Enable capture on the positive edge
         */
        uint32_t capn_mode:2;
        /** capn_prescale : R/W; bitpos: [10:3]; default: 0;
         *  Configures prescale value on possitive edge of CAPn. Prescale value =
         *  PWM_CAPn_PRESCALE + 1
         */
        uint32_t capn_prescale:8;
        /** capn_in_invert : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to invert CAPn from GPIO matrix before prescale.\\0:
         *  Normal\\1: Invert
         */
        uint32_t capn_in_invert:1;
        /** capn_sw : WT; bitpos: [12]; default: 0;
         *  Configures the generation of software capture.\\0: Invalid, No effect\\1: Trigger a
         *  software forced capture on channel n
         */
        uint32_t capn_sw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} mcpwm_cap_chn_cfg_reg_t;


/** Group: cap_ch */
/** Type of cap_chn register
 *  CAPn capture value register
 */
typedef union {
    struct {
        /** capn_value : RO; bitpos: [31:0]; default: 0;
         *  Represents value of last capture on CAPn
         */
        uint32_t capn_value:32;
    };
    uint32_t val;
} mcpwm_cap_chn_reg_t;


/** Group: edge */
/** Type of cap_status register
 *  Last capture trigger edge information register
 */
typedef union {
    struct {
        /** cap0_edge : RO; bitpos: [0]; default: 0;
         *  Represents edge of last capture trigger on channel0.\\0: Posedge\\1: Negedge
         */
        uint32_t cap0_edge:1;
        /** cap1_edge : RO; bitpos: [1]; default: 0;
         *  Represents edge of last capture trigger on channel1.\\0: Posedge\\1: Negedge
         */
        uint32_t cap1_edge:1;
        /** cap2_edge : RO; bitpos: [2]; default: 0;
         *  Represents edge of last capture trigger on channel2.\\0: Posedge\\1: Negedge
         */
        uint32_t cap2_edge:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} mcpwm_cap_status_reg_t;


