espressif/esp-idf/components/soc/esp32c5/include/soc/mcpwm_struct.h
/** Group: etm */
/** Type of evt_en register
 *  Event enable register
 */
typedef union {
    struct {
        /** evt_timer0_stop_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timer0 stop event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_timer0_stop_en:1;
        /** evt_timer1_stop_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable timer1 stop event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_timer1_stop_en:1;
        /** evt_timer2_stop_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable timer2 stop event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_timer2_stop_en:1;
        /** evt_timer0_tez_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable timer0 equal zero event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer0_tez_en:1;
        /** evt_timer1_tez_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable timer1 equal zero event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer1_tez_en:1;
        /** evt_timer2_tez_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable timer2 equal zero event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer2_tez_en:1;
        /** evt_timer0_tep_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to enable timer0 equal period event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer0_tep_en:1;
        /** evt_timer1_tep_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to enable timer1 equal period event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer1_tep_en:1;
        /** evt_timer2_tep_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable timer2 equal period event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_timer2_tep_en:1;
        /** evt_op0_tea_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal a event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_tea_en:1;
        /** evt_op1_tea_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal a event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_tea_en:1;
        /** evt_op2_tea_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal a event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_tea_en:1;
        /** evt_op0_teb_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal b event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_teb_en:1;
        /** evt_op1_teb_en : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal b event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_teb_en:1;
        /** evt_op2_teb_en : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal b event
         *  generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_teb_en:1;
        /** evt_f0_en : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to enable fault0 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_f0_en:1;
        /** evt_f1_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to enable fault1 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_f1_en:1;
        /** evt_f2_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether or not to enable fault2 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_f2_en:1;
        /** evt_f0_clr_en : R/W; bitpos: [18]; default: 0;
         *  Configures whether or not to enable fault0 clear event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_f0_clr_en:1;
        /** evt_f1_clr_en : R/W; bitpos: [19]; default: 0;
         *  Configures whether or not to enable fault1 clear event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_f1_clr_en:1;
        /** evt_f2_clr_en : R/W; bitpos: [20]; default: 0;
         *  Configures whether or not to enable fault2 clear event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_f2_clr_en:1;
        /** evt_tz0_cbc_en : R/W; bitpos: [21]; default: 0;
         *  Configures whether or not to enable cycle-by-cycle trip0 event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_tz0_cbc_en:1;
        /** evt_tz1_cbc_en : R/W; bitpos: [22]; default: 0;
         *  Configures whether or not to enable cycle-by-cycle trip1 event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_tz1_cbc_en:1;
        /** evt_tz2_cbc_en : R/W; bitpos: [23]; default: 0;
         *  Configures whether or not to enable cycle-by-cycle trip2 event generate.\\0:
         *  Disable\\1: Enable
         */
        uint32_t evt_tz2_cbc_en:1;
        /** evt_tz0_ost_en : R/W; bitpos: [24]; default: 0;
         *  Configures whether or not to enable one-shot trip0 event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_tz0_ost_en:1;
        /** evt_tz1_ost_en : R/W; bitpos: [25]; default: 0;
         *  Configures whether or not to enable one-shot trip1 event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_tz1_ost_en:1;
        /** evt_tz2_ost_en : R/W; bitpos: [26]; default: 0;
         *  Configures whether or not to enable one-shot trip2 event generate.\\0: Disable\\1:
         *  Enable
         */
        uint32_t evt_tz2_ost_en:1;
        /** evt_cap0_en : R/W; bitpos: [27]; default: 0;
         *  Configures whether or not to enable capture0 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_cap0_en:1;
        /** evt_cap1_en : R/W; bitpos: [28]; default: 0;
         *  Configures whether or not to enable capture1 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_cap1_en:1;
        /** evt_cap2_en : R/W; bitpos: [29]; default: 0;
         *  Configures whether or not to enable capture2 event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_cap2_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} mcpwm_evt_en_reg_t;

