espressif/esp-idf/components/soc/esp32c5/include/soc/mcpwm_struct.h
/** Type of task_en register
 *  Task enable register
 */
typedef union {
    struct {
        /** task_cmpr0_a_up_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer stamp A's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr0_a_up_en:1;
        /** task_cmpr1_a_up_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer stamp A's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr1_a_up_en:1;
        /** task_cmpr2_a_up_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer stamp A's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr2_a_up_en:1;
        /** task_cmpr0_b_up_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer stamp B's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr0_b_up_en:1;
        /** task_cmpr1_b_up_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer stamp B's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr1_b_up_en:1;
        /** task_cmpr2_b_up_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer stamp B's shadow register
         *  update task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cmpr2_b_up_en:1;
        /** task_gen_stop_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to enable all PWM generate stop task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_gen_stop_en:1;
        /** task_timer0_sync_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to enable timer0 sync task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_timer0_sync_en:1;
        /** task_timer1_sync_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable timer1 sync task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_timer1_sync_en:1;
        /** task_timer2_sync_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to enable timer2 sync task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_timer2_sync_en:1;
        /** task_timer0_period_up_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to enable timer0 period update task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_timer0_period_up_en:1;
        /** task_timer1_period_up_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to enable timer1 period update task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_timer1_period_up_en:1;
        /** task_timer2_period_up_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to enable timer2 period update task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_timer2_period_up_en:1;
        /** task_tz0_ost_en : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to enable one shot trip0 task receive.\\0: Disable\\1:
         *  Enable
         */
        uint32_t task_tz0_ost_en:1;
        /** task_tz1_ost_en : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to enable one shot trip1 task receive.\\0: Disable\\1:
         *  Enable
         */
        uint32_t task_tz1_ost_en:1;
        /** task_tz2_ost_en : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to enable one shot trip2 task receive.\\0: Disable\\1:
         *  Enable
         */
        uint32_t task_tz2_ost_en:1;
        /** task_clr0_ost_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to enable one shot trip0 clear task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_clr0_ost_en:1;
        /** task_clr1_ost_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether or not to enable one shot trip1 clear task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_clr1_ost_en:1;
        /** task_clr2_ost_en : R/W; bitpos: [18]; default: 0;
         *  Configures whether or not to enable one shot trip2 clear task receive.\\0:
         *  Disable\\1: Enable
         */
        uint32_t task_clr2_ost_en:1;
        /** task_cap0_en : R/W; bitpos: [19]; default: 0;
         *  Configures whether or not to enable capture0 task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cap0_en:1;
        /** task_cap1_en : R/W; bitpos: [20]; default: 0;
         *  Configures whether or not to enable capture1 task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cap1_en:1;
        /** task_cap2_en : R/W; bitpos: [21]; default: 0;
         *  Configures whether or not to enable capture2 task receive.\\0: Disable\\1: Enable
         */
        uint32_t task_cap2_en:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} mcpwm_task_en_reg_t;

/** Type of evt_en2 register
 *  Event enable register2
 */
typedef union {
    struct {
        /** evt_op0_tee1_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_tee1_en:1;
        /** evt_op1_tee1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_tee1_en:1;
        /** evt_op2_tee1_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_tee1_en:1;
        /** evt_op0_tee2_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_tee2_en:1;
        /** evt_op1_tee2_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_tee2_en:1;
        /** evt_op2_tee2_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_tee2_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_evt_en2_reg_t;


/** Group: tstmp */
/** Type of opn_tstmp_e1 register
 *  Generatorn timer stamp E1 value register
 */
typedef union {
    struct {
        /** opn_tstmp_e1 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generatorn timer stamp E1 value register
         */
        uint32_t opn_tstmp_e1:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_e1_reg_t;

/** Type of opn_tstmp_e2 register
 *  Generatorn timer stamp E2 value register
 */
typedef union {
    struct {
        /** opn_tstmp_e2 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generatorn timer stamp E2 value register
         */
        uint32_t opn_tstmp_e2:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_e2_reg_t;

/** Type of clk register
 *  Global configuration register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.\\0: Open the clock gate only
         *  when application writes registers\\1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} mcpwm_clk_reg_t;


/** Group: Version register */
/** Type of version register
 *  Version register.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35725968;
         *  Configures the version.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} mcpwm_version_reg_t;


